In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv("insurance.csv")

In [3]:
data.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [4]:
data.drop("age",axis=1,inplace=True)

In [5]:
data.head()

      sex     bmi  children smoker     region      charges
0  female  27.900         0    yes  southwest  16884.92400
1    male  33.770         1     no  southeast   1725.55230
2    male  33.000         3     no  southeast   4449.46200
3    male  22.705         0     no  northwest  21984.47061
4    male  28.880         0     no  northwest   3866.85520

In [6]:
data.drop("sex",axis=1, inplace=True)

In [8]:
data.head(10)

      bmi  children smoker     region      charges
0  27.900         0    yes  southwest  16884.92400
1  33.770         1     no  southeast   1725.55230
2  33.000         3     no  southeast   4449.46200
3  22.705         0     no  northwest  21984.47061
4  28.880         0     no  northwest   3866.85520
5  25.740         0     no  southeast   3756.62160
6  33.440         1     no  southeast   8240.58960
7  27.740         3     no  northwest   7281.50560
8  29.830         2     no  northeast   6406.41070
9  25.840         0     no  northwest  28923.13692

In [10]:
data.drop("children",axis=1,inplace=True)

In [11]:
data.head()

      bmi smoker     region      charges
0  27.900    yes  southwest  16884.92400
1  33.770     no  southeast   1725.55230
2  33.000     no  southeast   4449.46200
3  22.705     no  northwest  21984.47061
4  28.880     no  northwest   3866.85520

In [12]:
data.drop("region",axis=1,inplace=True)

In [13]:
data.head()

      bmi smoker      charges
0  27.900    yes  16884.92400
1  33.770     no   1725.55230
2  33.000     no   4449.46200
3  22.705     no  21984.47061
4  28.880     no   3866.85520

In [14]:
data.drop("smoker",axis=1,inplace=True)

In [15]:
data.head()

      bmi      charges
0  27.900  16884.92400
1  33.770   1725.55230
2  33.000   4449.46200
3  22.705  21984.47061
4  28.880   3866.85520

In [16]:
X=data['bmi'].values
Y=data['charges'].values

In [19]:
mean_x=np.mean(X)
mean_y=np.mean(Y)
m=len(X)
num=0
den=0
for i in range(m):
  num+=(X[i]-mean_x)*(Y[i]-mean_y)
  den+=(X[i]-mean_x)*(X[i]-mean_x)  
b0=num/den
b1=mean_y-b0*mean_x
print(b0,b1)

393.87303079739496 1192.937208961157

In [22]:
s_t=0
s_r=0
for i in range(m):
 y_p=b0*X[i]+b1
 s_t+=(y_p-mean_y)*(y_p-mean_y)
 s_r+=(Y[i]-mean_y)*(Y[i]-mean_y)
r_square=s_t/s_r
print(r_square)

0.03933913991786261